app/controllers/polls_controller.rb

  def index
    @polls = Poll.all
---
SELECT "polls".* FROM "polls"

  def create
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save
---
INSERT INTO "polls" ("name", "laptop", "os", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["laptop", "<3 bytes of binary data>"], ["os", "Mac"], ["created_at", "2017-08-10 19:40:01.842018"], ["updated_at", "2017-08-10 19:40:01.842018"]]

  def update
    respond_to do |format|
      if @poll.update(poll_params)
---
UPDATE "polls" SET "name" = ?, "laptop" = ?, "os" = ?, "updated_at" = ? WHERE "polls"."id" = ?  [["name", "Test Linux"], ["laptop", "<4 bytes of binary data>"], ["os", "Linux"], ["updated_at", "2017-08-10 20:06:39.126605"], ["id", 4]]

  def destroy
    @poll.destroy
---
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 3]]

    def set_poll
      @poll = Poll.find(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]